In [1]:
import pandas as pd
from math import sqrt

In [2]:
oyuncular = {"boy": [175,177,178,181,182,183,184,188,190], "deneyim": [4,6,3,2,6,3,7,2,6], "maas": [12,18,15,16,24,20,28,24,32]}

In [3]:
df = pd.DataFrame(oyuncular)

In [4]:
df

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [5]:
df.maas.mean()

21.0

In [6]:
df.maas - df.maas.mean()

0    -9.0
1    -3.0
2    -6.0
3    -5.0
4     3.0
5    -1.0
6     7.0
7     3.0
8    11.0
Name: maas, dtype: float64

In [7]:
df["boy"] < 18*10

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
Name: boy, dtype: bool

# Mean Model

In [8]:
(df.maas - df.maas.mean()).pow(2).sum()

340.0

# İlk Bölme

* 180 cm den uzun 
* 180 cm den kısa o.ü  oyuncular ikiye ayrılır.
* Veri seti toplamda 2'ye bölünmüş oldu.(df1, df2)

In [9]:
filt = (df.boy <= 180)
print(filt)

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
Name: boy, dtype: bool

In [10]:
# df1: 180 cm den kısa olan oyuncuların veri seti

df1 = df[filt]
df1

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15

In [12]:
df1.maas.mean()

15.0

In [11]:
# df2: 180 cm den uzun olan oyuncuların veri seti

df2 = df[~filt]
df2

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [13]:
df2.maas.mean()

24.0

## İlk Bölme: Error

In [14]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df2.maas - df2.maas.mean()).pow(2).sum()

178.0

# İkinci Bölme

* 180 cm den uzun olup 185 cm den uzun 
* 180 cm den uzun olup 185 cm den kısa olan oyuncular o.ü ikiye ayrılır.
* Veri seti toplamda 3'e bölünmüş oldu.(df1, df3, df4)

In [15]:
filt2 = (df2.boy <= 185)

In [16]:
# df3: 180 cm den uzun, 185 cm'e küçük veya eşit olan oyuncuların veri seti

df3 = df2[filt2]
df3

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28

In [18]:
df3.maas.mean()

22.0

In [17]:
# df4: 180 cm den uzun, 185 cm den uzun olan oyuncuların veri seti

df4 = df2[~filt2]
df4

   boy  deneyim  maas
7  188        2    24
8  190        6    32

In [37]:
df4.maas.mean()

28.0

## İkinci Bölme: Error

In [38]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df3.maas - df3.maas.mean()).pow(2).sum() + (df4.maas - df4.maas.mean()).pow(2).sum()

130.0

# Üçüncü Bölme

* 180 cm den uzun olup 185 cm den uzun, deneyimi 5 yıldan fazla
* 180 cm den uzun olup 185 cm den kısa, deneyimi 5 yıla küçük eşit olan oyuncular o.ü ikiye ayrılır.
* Toplamda 4'e bölünmüş oldu.(df1, df4, df5, df6)

In [27]:
filt3 = (df3.deneyim <= 5)
print(filt3)

3     True
4    False
5     True
6    False
Name: deneyim, dtype: bool

In [25]:
# df5: 180 cm den uzun, 185 cm'e küçük veya eşit,
# deneyimi 5 yıla küçük eşit olan oyuncuların veri seti

df5 = df3[filt3]
df5

   boy  deneyim  maas
3  181        2    16
5  183        3    20

In [39]:
df5.maas.mean()

18.0

In [28]:
# df6: 180 cm den uzun, 185 cm'e küçük veya eşit,
# deneyimi 5 yıldan fazla olan oyuncuların veri seti

df6 = df3[~filt3]
df6

   boy  deneyim  maas
4  182        6    24
6  184        7    28

In [40]:
df6.maas.mean()

26.0

## Üçüncü Bölme: Error

In [41]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df4.maas - df.maas.mean()).pow(2).sum() + (df5.maas - df5.maas.mean()).pow(2).sum() + (df6.maas - df6.maas.mean()).pow(2).sum()

164.0